{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "from generate_graph import get_propositions, generateEdges, createGraph, get_propositions_nosplit\n",
    "from refine_graph import refine\n",
    "from query_graph import QueryGraph\n",
    "from tqdm import tqdm\n",
    "tqdm.pandas()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.read_json('datasets/HotPotQA/hotpot_dev_distractor_v1.json')\n",
    "# df.info()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Experiment\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Graph creation and refinement section"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To run the evaluation script\n",
    "\n",
    "```\n",
    "python hotpot_evaluate_v1.py <path_to_prediction> <path_to_gold>\n",
    "```\n",
    "\n",
    "Example:\n",
    "\n",
    "```\n",
    "python hotpot_evaluate_v1.py <sample_dev_pred.json> <hotpot_dev_fullwiki_v1.json>\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "context_list = df['context']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3    [[Esma Sultan (daughter of Abdülaziz), [Esma S...\n",
       "Name: context, dtype: object"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "context_list[3:4]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 1/1 [00:45<00:00, 45.00s/it]\n"
     ]
    }
   ],
   "source": [
    "propositions = []\n",
    "\n",
    "for i, value in enumerate(tqdm(context_list[3:4])):\n",
    "        for j, context in enumerate(value):\n",
    "                index = 1\n",
    "                if index < len(context):\n",
    "                    words = context[1]\n",
    "                    combined = \" \".join(words)\n",
    "                    get_propositions_nosplit(combined, propositions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Ed Wood is a 1994 American biographical period comedy-drama film.', 'Tim Burton directed and produced Ed Wood.', 'Johnny Depp stars as cult filmmaker Ed Wood in Ed Wood.', \"The film concerns the period in Ed Wood's life when Ed Wood made his best-known films.\", \"The film also concerns Ed Wood's relationship with actor Bela Lugosi.\", 'Martin Landau plays the role of Bela Lugosi in Ed Wood.', 'Sarah Jessica Parker is among the supporting cast of Ed Wood.', 'Patricia Arquette is among the supporting cast of Ed Wood.', 'Jeffrey Jones is among the supporting cast of Ed Wood.', 'Lisa Marie is among the supporting cast of Ed Wood.', 'Bill Murray is among the supporting cast of Ed Wood.', 'Scott Derrickson was born on July 16, 1966.', 'Scott Derrickson is an American director.', 'Scott Derrickson is a screenwriter.', 'Scott Derrickson is a producer.', 'Scott Derrickson lives in Los Angeles, California.', 'Scott Derrickson is best known for directing horror films.', \"Scott Derrickson directed the horror film 'Sinister'.\", \"Scott Derrickson directed the horror film 'The Exorcism of Emily Rose'.\", \"Scott Derrickson directed the horror film 'Deliver Us From Evil'.\", \"Scott Derrickson directed the 2016 Marvel Cinematic Universe installment 'Doctor Strange'.\", 'Woodson is a census-designated place in Pulaski County, Arkansas.', 'Pulaski County is located in the United States.', 'The population of Woodson was 403 at the 2010 census.', 'Woodson is part of the Little Rock–North Little Rock–Conway Metropolitan Statistical Area.', 'Woodson is accompanied by Woodson Lake and Wood Hollow.', 'Woodson, Woodson Lake, and Wood Hollow are the namesake for Ed Wood Sr.', 'Ed Wood Sr. was a prominent plantation owner, trader, and businessman at the turn of the 20th century.', 'Woodson is adjacent to the Wood Plantation.', 'The Wood Plantation is the largest of the plantations owned by Ed Wood Sr.', 'Tyler Bates was born on June 5, 1965.', 'Tyler Bates is an American musician.', 'Tyler Bates is a music producer.', 'Tyler Bates is a composer for films.', 'Tyler Bates is a composer for television.', 'Tyler Bates is a composer for video games.', \"Much of Tyler Bates's work is in the action film genre.\", \"Much of Tyler Bates's work is in the horror film genre.\", \"Tyler Bates worked on the film 'Dawn of the Dead.'\", \"Tyler Bates worked on the film '300.'\", \"Tyler Bates worked on the film 'Sucker Punch.'\", \"Tyler Bates worked on the film 'John Wick.'\", 'Tyler Bates has collaborated with Zack Snyder.', 'Tyler Bates has collaborated with Rob Zombie.', 'Tyler Bates has collaborated with Neil Marshall.', 'Tyler Bates has collaborated with William Friedkin.', 'Tyler Bates has collaborated with Scott Derrickson.', 'Tyler Bates has collaborated with James Gunn.', \"Tyler Bates has scored every one of James Gunn's films.\", \"Tyler Bates scored the film 'Guardians of the Galaxy.'\", \"'Guardians of the Galaxy' became one of the highest grossing domestic movies of 2014.\", \"Tyler Bates scored the 2017 sequel to 'Guardians of the Galaxy.'\", 'Tyler Bates is the lead guitarist of the American rock band Marilyn Manson.', \"Tyler Bates produced the album 'The Pale Emperor.'\", \"Tyler Bates produced the album 'Heaven Upside Down.'\", 'Edward Davis Wood Jr. was an American filmmaker.', 'Edward Davis Wood Jr. was an American actor.', 'Edward Davis Wood Jr. was an American writer.', 'Edward Davis Wood Jr. was an American producer.', 'Edward Davis Wood Jr. was an American director.', 'Edward Davis Wood Jr. was born on October 10, 1924.', 'Edward Davis Wood Jr. died on December 10, 1978.', 'Deliver Us from Evil is a 2014 American supernatural horror film.', 'Scott Derrickson directed Deliver Us from Evil.', 'Jerry Bruckheimer produced Deliver Us from Evil.', \"Deliver Us from Evil is officially based on a 2001 non-fiction book entitled 'Beware the Night'.\", \"The authors of 'Beware the Night' are Ralph Sarchie and Lisa Collier Cool.\", 'The marketing campaign for Deliver Us from Evil highlighted that it was inspired by actual accounts.', 'Deliver Us from Evil stars Eric Bana in a main role.', 'Deliver Us from Evil stars Édgar Ramírez in a main role.', 'Deliver Us from Evil stars Sean Harris in a main role.', 'Deliver Us from Evil stars Olivia Munn in a main role.', 'Deliver Us from Evil stars Joel McHale in a main role.', 'Deliver Us from Evil was released on July 2, 2014.', 'Adam Collis is an American filmmaker.', 'Adam Collis is an actor.', 'Adam Collis attended Duke University from 1986 to 1990.', 'Adam Collis attended the University of California, Los Angeles from 2007 to 2010.', 'Adam Collis studied cinema at the University of Southern California from 1991 to 1997.', \"Adam Collis's first work was as the assistant director for Scott Derrickson's short 'Love in the Ruins' in 1995.\", \"In 1998, Adam Collis played 'Crankshaft' in Eric Koyanagi's film 'Hundred Percent'.\", 'Sinister is a 2012 supernatural horror film.', 'Scott Derrickson directed the film Sinister.', 'Scott Derrickson co-wrote the film Sinister with C. Robert Cargill.', 'Ethan Hawke stars in the film Sinister.', 'Ethan Hawke plays the role of fictional true-crime writer Ellison Oswalt in the film Sinister.', 'Ellison Oswalt discovers a box of home movies in his attic.', \"The box of home movies puts Ellison Oswalt's family in danger.\", 'Conrad Brooks was born Conrad Biedrzycki on January 3, 1931 in Baltimore, Maryland.', 'Conrad Brooks is an American actor.', 'Conrad Brooks moved to Hollywood, California in 1948 to pursue a career in acting.', 'Conrad Brooks got his start in movies by appearing in Ed Wood films.', \"Conrad Brooks appeared in the Ed Wood film 'Plan 9 from Outer Space.'\", \"Conrad Brooks appeared in the Ed Wood film 'Glen or Glenda.'\", \"Conrad Brooks appeared in the Ed Wood film 'Jail Bait.'\", 'Conrad Brooks took a break from acting during the 1960s and 1970s.', 'Due to the ongoing interest in the films of Ed Wood, Conrad Brooks reemerged in the 1980s.', 'Conrad Brooks has become a prolific actor.', 'Conrad Brooks has gone on to write several films.', 'Conrad Brooks has gone on to produce several films.', 'Conrad Brooks has gone on to direct several films.', 'Doctor Strange is a 2016 American superhero film.', 'Doctor Strange is based on the Marvel Comics character of the same name.', 'Doctor Strange was produced by Marvel Studios.', 'Doctor Strange was distributed by Walt Disney Studios Motion Pictures.', 'Doctor Strange is the fourteenth film of the Marvel Cinematic Universe.', 'The film Doctor Strange was directed by Scott Derrickson.', 'Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.', 'Benedict Cumberbatch stars as Stephen Strange in the film Doctor Strange.', 'Chiwetel Ejiofor stars in the film Doctor Strange.', 'Rachel McAdams stars in the film Doctor Strange.', 'Benedict Wong stars in the film Doctor Strange.', 'Michael Stuhlbarg stars in the film Doctor Strange.', 'Benjamin Bratt stars in the film Doctor Strange.', 'Scott Adkins stars in the film Doctor Strange.', 'Mads Mikkelsen stars in the film Doctor Strange.', 'Tilda Swinton stars in the film Doctor Strange.', 'In the film Doctor Strange, surgeon Stephen Strange learns the mystic arts after a career-ending car accident.', \"Corliss Archer is a program from radio's Golden Age.\", 'Corliss Archer ran from January 7, 1943 to September 30, 1956.', \"Corliss Archer was CBS's answer to NBC's popular program 'A Date with Judy'.\", 'Corliss Archer was also broadcast by NBC in 1948.', \"NBC broadcast Corliss Archer as a summer replacement for 'The Bob Hope Show'.\", 'Corliss Archer aired on ABC from October 3, 1952 to June 26, 1953.', 'Corliss Archer finally returned to CBS after airing on ABC.', \"Fewer than 24 episodes of Corliss Archer are known to exist despite the program's long run.\", 'Shirley Temple Black was an American actress.', 'Shirley Temple Black was a singer.', 'Shirley Temple Black was a dancer.', 'Shirley Temple Black was a businesswoman.', 'Shirley Temple Black was a diplomat.', \"Shirley Temple Black was Hollywood's number one box-office draw as a child actress from 1935 to 1938.\", 'Shirley Temple Black was named United States ambassador to Ghana.', 'Shirley Temple Black was named United States ambassador to Czechoslovakia.', 'Shirley Temple Black served as Chief of Protocol of the United States.', 'Shirley Temple Black was born on April 23, 1928.', 'Shirley Temple Black passed away on February 10, 2014.', 'Janet Marie Waldo was an American radio and voice actress.', 'Janet Marie Waldo was born on February 4, 1920.', 'Janet Marie Waldo passed away on June 12, 2016.', 'Janet Marie Waldo is best known in animation for voicing Judy Jetson.', \"Janet Marie Waldo is best known in animation for voicing Nancy in 'Shazzan'.\", 'Janet Marie Waldo is best known in animation for voicing Penelope Pitstop.', \"Janet Marie Waldo is best known in animation for voicing Josie in 'Josie and the Pussycats'.\", \"Janet Marie Waldo is best known on radio as the title character in 'Meet Corliss Archer'.\", 'Meet Corliss Archer is an American television sitcom.', 'Meet Corliss Archer aired on CBS from July 13, 1951 to August 10, 1951.', 'Meet Corliss Archer was in syndication via the Ziv Company from April to December 1954.', 'The program was an adaptation of the radio series of the same name.', 'The radio series of the same name was based on a series of short stories by F. Hugh Herbert.', 'F. Hugh Herbert was the author of the series of short stories.', 'The post of Lord High Treasurer was an English government position.', 'The post of Lord High Treasurer has been a British government position since the Acts of Union of 1707.', 'A holder of the post of Lord High Treasurer would be the third-highest-ranked Great Officer of State.', 'The Lord High Treasurer is ranked below the Lord High Steward.', 'The Lord High Treasurer is ranked below the Lord High Chancellor.', 'A Kiss for Corliss is a 1949 American comedy film.', 'Richard Wallace directed A Kiss for Corliss.', 'Howard Dimsdale wrote A Kiss for Corliss.', 'Shirley Temple stars in A Kiss for Corliss.', \"A Kiss for Corliss is Shirley Temple's final starring role.\", \"A Kiss for Corliss is Shirley Temple's final film appearance.\", 'A Kiss for Corliss is a sequel to the 1945 film Kiss and Tell.', 'A Kiss for Corliss was retitled Almost a Bride before release.', 'The title Almost a Bride appears in the title sequence of A Kiss for Corliss.', 'A Kiss for Corliss was released on November 25, 1949.', 'United Artists released A Kiss for Corliss.', 'Kiss and Tell is a 1945 American comedy film.', 'Shirley Temple starred in Kiss and Tell.', 'Shirley Temple was 17 years old when she starred in Kiss and Tell.', 'Shirley Temple played the character Corliss Archer in Kiss and Tell.', 'In the film, two teenage girls cause their respective parents much concern.', 'The two teenage girls start to become interested in boys.', 'The parents bicker about which girl is the worse influence.', \"The parents' bickering causes more problems than it solves.\", 'The office of Secretary of State for Constitutional Affairs was a British Government position.', 'The office of Secretary of State for Constitutional Affairs was created in 2003.', \"Certain functions of the Lord Chancellor were related to the Lord Chancellor's Department.\", 'Certain functions of the Lord Chancellor were transferred to the Secretary of State for Constitutional Affairs.', 'At a later date, further functions were transferred to the Secretary of State for Constitutional Affairs.', 'The further functions were transferred from the First Secretary of State.', 'The First Secretary of State is a position within the government.', 'The position of First Secretary of State was held by the Deputy Prime Minister.', 'The Village Accountant is an administrative government position.', 'The Village Accountant is found in rural parts of the Indian sub-continent.', \"The Village Accountant is variously known as 'Patwari', 'Talati', 'Patel', 'Karnam', 'Adhikari', 'Shanbogaru', 'Patnaik', etc.\", \"The office and the officeholder are called the 'patwari' in Telangana.\", \"The office and the officeholder are called the 'patwari' in Bengal.\", \"The office and the officeholder are called the 'patwari' in North India.\", \"The office and the officeholder are called the 'patwari' in Pakistan.\", \"In Sindh, the position is called 'tapedar'.\", \"The position is known as the 'karnam' in Andhra Pradesh.\", \"The position is known as the 'patnaik' in Orissa.\", \"The position is known as the 'adhikari' in Tamil Nadu.\", \"The position is commonly known as the 'talati' in Karnataka.\", \"The position is commonly known as the 'talati' in Gujarat.\", \"The position is commonly known as the 'talati' in Maharashtra.\", \"The position was known as the 'kulkarni' in Northern Karnataka.\", \"The position was known as the 'kulkarni' in Maharashtra.\", \"The position was known as the 'shanbogaru' in South Karnataka.\", 'Charles Craft was an English-born American film and television editor.', 'Charles Craft was born in the county of Hampshire in England on May 9, 1902.', 'Charles Craft entered the film industry in Hollywood in 1927.', \"The first film edited by Charles Craft was the Universal Pictures silent film, 'Painting the Town'.\", 'Over the next 25 years, Charles Craft edited 90 feature-length films.', 'In the early 1950s, Charles Craft switched his focus to the small screen.', \"The first show edited by Charles Craft was 'Racket Squad', from 1951 to 1953.\", \"Charles Craft was the main editor for 'Racket Squad', editing 93 of the 98 episodes.\", 'Charles Craft worked on several other series during the 1950s.', \"One of the series Charles Craft worked on during the 1950s was 'Meet Corliss Archer' in 1954.\", \"Another series Charles Craft worked on during the 1950s was 'Science Fiction Theatre' from 1955 to 1956.\", \"Charles Craft also worked on 'Highway Patrol' from 1955 to 1957.\", \"In the late 1950s and early 1960s, Charles Craft was one of the main editors on 'Sea Hunt'.\", \"The series 'Sea Hunt' starred Lloyd Bridges.\", \"Charles Craft edited over half of the episodes of 'Sea Hunt'.\", \"Charles Craft's final film work was editing 'Flipper's New Adventure' in 1964.\", \"'Flipper's New Adventure' was the sequel to 1963's 'Flipper'.\", \"When 'Flipper' was made into a television series, Charles Craft began the editing duties on that show.\", \"Charles Craft edited the first 28 episodes of the 'Flipper' television series.\", 'Charles Craft retired in 1966.', 'Charles Craft died on September 19, 1968, in Los Angeles, California.', 'The Andre Norton Award for Young Adult Science Fiction and Fantasy is an annual award.', 'The Andre Norton Award is presented by the Science Fiction and Fantasy Writers of America.', 'The Andre Norton Award is presented to the author of the best young adult or middle grade science fiction or fantasy book.', 'The best young adult or middle grade science fiction or fantasy book must be published in the United States in the preceding year.', 'The Andre Norton Award is named to honor Andre Norton.', 'Andre Norton was a prolific science fiction and fantasy author.', 'Andre Norton was born in 1912 and died in 2005.', 'The Andre Norton Award was established by Catherine Asaro.', 'Catherine Asaro was the then president of the Science Fiction and Fantasy Writers of America.', 'The Andre Norton Award was established by the SFWA Young Adult Fiction committee.', 'The establishment of the Andre Norton Award was announced on February 20, 2005.', 'Any published young adult or middle grade science fiction or fantasy novel is eligible for the Andre Norton Award.', 'Graphic novels are included in the eligibility for the Andre Norton Award.', 'There is no limit on word count for the works eligible for the Andre Norton Award.', 'The Andre Norton Award is presented along with the Nebula Awards.', 'The Andre Norton Award follows the same rules for nominations and voting as the Nebula Awards.', 'The Andre Norton Award and the Nebula Awards are separate awards.', 'Works may be simultaneously nominated for both the Andre Norton Award and a Nebula Award.', 'Victoria Hanley is an American young adult fantasy novelist.', \"Victoria Hanley's first three books are 'The Seer And The Sword', 'The Healer's Keep', and 'The Light Of The Oracle'.\", \"'The Seer And The Sword', 'The Healer's Keep', and 'The Light Of The Oracle' are companion books to one another.\", \"Victoria Hanley's newest book was released in March 2012.\", \"Victoria Hanley's newest book is the sequel of a series called 'Indigo Magic'.\", \"'Indigo Magic' was published by Egmont USA.\", 'Victoria Hanley has published two non-fiction books through Cotton Wood Press.', \"The titles of Victoria Hanley's two non-fiction books are 'Seize the Story: A Handbook For Teens Who Like To Write' and 'Wild Ink: A Grownups Guide To Writing Fiction For Teens'.\", 'The Hork-Bajir Chronicles is the second companion book to the Animorphs series.', 'K. A. Applegate wrote The Hork-Bajir Chronicles.', 'The Hork-Bajir Chronicles takes place before book #23, titled The Pretender.', 'The events told in The Hork-Bajir Chronicles occur between the time of The Ellimist Chronicles and The Andalite Chronicles.', 'The book is introduced by Tobias.', 'Tobias flies to the valley of the free Hork-Bajir.', 'Jara Hamee tells Tobias the story of how the Yeerks enslaved the Hork-Bajir.', 'Aldrea is an Andalite.', 'Dak Hamee is a Hork-Bajir.', 'Aldrea and Dak Hamee tried to save their world from the invasion.', \"Jara Hamee's story is narrated from the points of view of Aldrea, Dak Hamee, and Esplin 9466.\", 'The narration alternates in a similar fashion to the Megamorphs books.', 'Shadowshaper is a 2015 American urban fantasy young adult novel.', 'Shadowshaper was written by Daniel José Older.', 'Shadowshaper follows Sierra Santiago.', 'Sierra Santiago is an Afro-Boricua teenager.', 'Sierra Santiago lives in Brooklyn.', 'Sierra Santiago is the granddaughter of a shadowshaper.', 'A shadowshaper is a person who infuses art with ancestral spirits.', \"Forces of gentrification invade Sierra Santiago's community.\", 'A mysterious being appropriates the magic of the shadowshapers.', 'The mysterious being begins to hunt the aging shadowshapers.', 'Sierra Santiago must learn about her artistic and spiritual heritage.', 'Sierra Santiago must learn about her artistic and spiritual heritage to foil the killer.', 'Left Behind: The Kids is a series.', 'Left Behind: The Kids is stylized as LEFT BEHIND >THE KIDS<.', 'The series was written by Jerry B. Jenkins.', 'The series was written by Tim LaHaye.', 'The series was written by Chris Fabry.', 'The series consists of 40 short novels.', 'The series is aimed primarily at the young adult market.', 'The series is based on the adult series Left Behind.', 'The adult series Left Behind was also written by Jerry B. Jenkins.', 'The series follows a core group of teenagers.', 'The teenagers experience the rapture and tribulation.', 'The rapture and tribulation are based on scriptures found in the Bible.', 'The rapture and tribulation are based on background plots introduced in the adult novels.', 'The books were published by Tyndale House Publishing.', 'The books were released over the 7 year period of 1997-2004.', 'The series has sold over 11 million copies worldwide.', 'Dozens of Square Enix companion books have been produced since 1998.', 'Square Enix is a video game developer.', 'Square began to produce books that focused on artwork, developer interviews, and background information on the fictional worlds and characters in its games in 1998.', \"Square's books did not focus on gameplay details.\", \"The first series of these books was the 'Perfect Works' series.\", \"The 'Perfect Works' series was written and published by Square subsidiary DigiCube.\", 'DigiCube produced three books between 1998 and 1999.', \"The 'Perfect Works' series was stopped in favor of the 'Ultimania' series.\", \"The 'Ultimania' series is a portmanteau of ultimate and mania.\", \"The 'Ultimania' series of books is written by Studio BentStuff.\", \"Studio BentStuff had previously written game guides for Square for 'Final Fantasy VII'.\", \"The 'Ultimania' series of books was published by DigiCube.\", 'DigiCube was dissolved in 2003.', 'Square merged with video game publisher Enix on April 1, 2003.', 'The merger formed Square Enix.', 'Square Enix resumed publication of the companion books.', 'The Divide trilogy is a fantasy young adult novel trilogy.', 'The Divide trilogy was written by Elizabeth Kay.', 'The Divide trilogy takes place in an alternate universe.', \"The three books in The Divide trilogy are 'The Divide' (2002), 'Back to The Divide' (2005), and 'Jinx on The Divide' (2006).\", 'The first novel of The Divide trilogy was originally published by Chicken House.', 'Chicken House is a small press publisher.', 'Chicken House is now a division of Scholastic.', 'Subsequent volumes of The Divide trilogy were published by Scholastic.', 'Scholastic also reprinted the first novel of The Divide trilogy.', 'The books of The Divide trilogy have been translated into French.', 'The books of The Divide trilogy have been translated into German.', 'The books of The Divide trilogy have been translated into Spanish.', 'The books of The Divide trilogy have been translated into Finnish.', 'The books of The Divide trilogy have been translated into Chinese.', 'The books of The Divide trilogy have been translated into Japanese.', 'The books of The Divide trilogy have been translated into Portuguese.', 'The books of The Divide trilogy have been translated into Italian.', 'The books of The Divide trilogy have been translated into Romanian.', 'The books of The Divide trilogy have been translated into Dutch.', 'Interior illustrations for The Divide trilogy are by Ted Dewan.', 'Science Fantasy was a British fantasy and science fiction magazine.', 'Science Fantasy also appeared under the titles Impulse and SF Impulse.', 'Science Fantasy was launched in 1950 by Nova Publications.', \"Science Fantasy was launched as a companion to Nova's 'New Worlds'.\", 'Walter Gillings was the editor for the first two issues of Science Fantasy.', 'Walter Gillings was replaced by John Carnell as the editor of Science Fantasy.', \"John Carnell was the editor of 'New Worlds'.\", 'John Carnell was appointed as a cost-saving measure.', \"John Carnell edited both Science Fantasy and 'New Worlds' until Nova went out of business in early 1964.\", 'The titles Science Fantasy and Impulse were acquired by Roberts & Vinter.', 'Roberts & Vinter hired Kyril Bonfiglioli to edit Science Fantasy.', 'Kyril Bonfiglioli changed the title of Science Fantasy to Impulse in early 1966.', 'The new title Impulse led to confusion with the distributors.', 'Sales of Impulse fell, though the magazine remained profitable.', 'The title was changed again to SF Impulse for the last few issues.', 'Science Fantasy ceased publication the following year.', 'Science Fantasy ceased publication when Roberts & Vinter came under financial pressure.', 'Roberts & Vinter came under financial pressure after their printer went bankrupt.', 'Animorphs is a science fantasy series of young adult books.', 'Katherine Applegate is one of the authors of the Animorphs series.', 'Michael Grant is the husband of Katherine Applegate.', 'Katherine Applegate and Michael Grant write together under the name K. A. Applegate.', 'The Animorphs series was published by Scholastic.', 'The story of the Animorphs series is told in first person.', 'All six main characters take turns narrating the books through their own perspectives.', 'Horror is one of the core themes of the Animorphs series.', 'War is one of the core themes of the Animorphs series.', 'Dehumanization is one of the core themes of the Animorphs series.', 'Sanity is one of the core themes of the Animorphs series.', 'Morality is one of the core themes of the Animorphs series.', 'Innocence is one of the core themes of the Animorphs series.', 'Leadership is one of the core themes of the Animorphs series.', 'Freedom is one of the core themes of the Animorphs series.', 'Growing up is one of the core themes of the Animorphs series.', 'Etiquette & Espionage is a young adult steampunk novel.', 'Gail Carriger is the author of Etiquette & Espionage.', \"Etiquette & Espionage is Gail Carriger's first young adult novel.\", 'Etiquette & Espionage is set in the same universe as the bestselling Parasol Protectorate adult series.', '', 'Esma Sultan was an Ottoman princess.', 'Esma Sultan was born on 21 March 1873.', 'Esma Sultan died on 7 May 1899.', 'Esma Sultan was the daughter of Sultan Abdülaziz.', 'Sultan Abdülaziz was the husband of Gevheri Kadın.', 'Gevheri Kadın was the mother of Esma Sultan.', 'Gevheri Kadın was the daughter of Salih Bey Svatnba.', 'Esma Sultan was the half-sister of Abdülmecid II.', 'Abdülmecid II was the last Caliph of the Muslim world.', 'The Great Mosque of Algiers is a mosque in Algiers, Algeria.', 'The Great Mosque of Algiers is located very close to Algiers Harbor.', 'The Arabic name for The Great Mosque of Algiers is الجامع الكبير\\u200e.', \"The Great Mosque of Algiers is also known as 'Jemaa Kebir'.\", \"'Jemaa Kebir' means Great Mosque.\", 'An inscription on the minbar testifies to the fact that The Great Mosque of Algiers was built in 1097.', \"The Great Mosque of Algiers is known by several other names such as Grand Mosque d'Alger, Djamaa al-Kebir, El Kebir Mosque, and Jami Masjid.\", 'The Great Mosque of Algiers is one of the few remaining examples of Almoravid architecture.', 'The Great Mosque of Algiers is the oldest mosque in Algiers.', 'The Great Mosque of Algiers is said to be the oldest mosque in Algeria after Sidi Okba Mosque.', 'The Great Mosque of Algiers was built under Sultan Ali ibn Yusuf.', 'The minaret of The Great Mosque of Algiers dates from 1332.', 'Some sources state that the minaret of The Great Mosque of Algiers dates from 1324.', 'The minaret of The Great Mosque of Algiers was built by the Ziyyanid Sultan of Tlemcen.', 'The gallery at the outside of The Great Mosque of Algiers was built in 1840.', 'The construction of the gallery at the outside of The Great Mosque of Algiers was a consequence of a complete reconstruction of the street by the French.', 'Küçük Hüseyin Pasha was born in 1757.', 'Küçük Hüseyin Pasha died on 7 December 1803.', 'Küçük Hüseyin Pasha is also known as Tayazade Damat Küçük Hüseyin Pasha.', 'Küçük Hüseyin Pasha was an Ottoman statesman.', 'Küçük Hüseyin Pasha was an admiral.', 'Küçük Hüseyin Pasha was Kapudan Pasha from 11 March 1792 to 7 December 1803.', 'Kapudan Pasha is the title for the Grand Admiral of the Ottoman Navy.', \"Küçük Hüseyin Pasha was a 'damat' to the Ottoman dynasty.\", 'Küçük Hüseyin Pasha married an Ottoman princess.', 'The name of the Ottoman princess that Küçük Hüseyin Pasha married is Esma Sultan.', 'Esma Sultan was an Ottoman princess.', 'Esma Sultan was born on 17 July 1778.', 'Esma Sultan died on 4 June 1848.', 'Esma Sultan was the daughter of Sultan Abdul Hamid I.', 'Esma Sultan was the sister of Sultan Mustafa IV.', 'Esma Sultan was the sister of Sultan Mahmud II.', 'Esma Sultan was the adoptive mother of Bezmiâlem Sultan.', 'Esma Sultan was the adoptive mother of Rahime Perestu Sultan.', 'The Sultan Ahmed Mosque is a historic mosque.', 'The Sultan Ahmed Mosque is located in Istanbul, Turkey.', 'The Sultan Ahmed Mosque is a popular tourist site.', 'The Sultan Ahmed Mosque continues to function as a mosque today.', \"Men still kneel in prayer on the mosque's lush red carpet after the call to prayer.\", 'The Blue Mosque is a popular name for the Sultan Ahmed Mosque.', 'The Sultan Ahmed Mosque was constructed between 1609 and 1616.', 'The construction of the Sultan Ahmed Mosque occurred during the rule of Ahmed I.', \"The Külliye of the Sultan Ahmed Mosque contains Ahmed's tomb.\", 'The Külliye of the Sultan Ahmed Mosque contains a madrasah.', 'The Külliye of the Sultan Ahmed Mosque contains a hospice.', 'Hand-painted blue tiles adorn the interior walls of the Sultan Ahmed Mosque.', \"At night, the Sultan Ahmed Mosque is bathed in blue as lights frame the mosque's five main domes.\", 'The Sultan Ahmed Mosque has six minarets.', 'The Sultan Ahmed Mosque has eight secondary domes.', 'The Sultan Ahmed Mosque sits next to the Hagia Sophia.', 'The Hagia Sophia is another popular tourist site.', 'The Laleli Mosque is an 18th-century Ottoman imperial mosque.', 'The Laleli Mosque is located in Laleli, Fatih, Istanbul, Turkey.', 'Laleli Mosque is also known as Laleli Camii or Tulip Mosque.', 'The Esma Sultan Mansion is a historical yalı.', 'The Esma Sultan Mansion is located at Bosphorus in the Ortaköy neighborhood of Istanbul, Turkey.', 'The Esma Sultan Mansion is named after its original owner Esma Sultan.', 'The Esma Sultan Mansion is used today as a cultural center.', 'The Esma Sultan Mansion was redeveloped.', 'Esma Sultan is the name of three daughters.', 'The three daughters are the daughters of three Ottoman Sultans.', 'Gevheri Kadın was born on 8 July 1856.', 'Gevheri Kadın died on 6 September 1884.', 'Gevheri Kadın was the fifth wife of Abdülaziz.', 'Abdülaziz was the 32nd Ottoman Sultan.', 'Gevheri Kadın was the mother of Şehzade Mehmed Seyfeddin.', 'Gevheri Kadın was the mother of Esma Sultan.', 'Şehzade Mehmed Seyfeddin was a member of the Ottoman Empire.', 'Esma Sultan was a member of the Ottoman Empire.', 'Esma Sultan was an Ottoman princess.', 'Esma Sultan was born on 14 March 1726.', 'Esma Sultan died on 13 August 1788.', 'Esma Sultan was the daughter of Sultan Ahmed III.', 'Sultan Ahmed III was the father of Esma Sultan.', 'Esma Sultan was the daughter of Zeynep Kadın.', 'Zeynep Kadın was the consort of Sultan Ahmed III.', 'Esma Sultan was the half-sister of Sultan Mustafa III.', 'Esma Sultan was the half-sister of Abdul Hamid I.']\n"
     ]
    }
   ],
   "source": [
    "# Open the file in read mode\n",
    "with open('propositions.txt', 'r') as file:\n",
    "    # Read all lines and store them in a list\n",
    "    propositions_from_file = [line.strip() for line in file]\n",
    "\n",
    "print(propositions_from_file)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  0%|          | 0/140 [00:00<?, ?it/s]"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 140/140 [05:42<00:00,  2.44s/it]\n"
     ]
    }
   ],
   "source": [
    "list_of_edges = generateEdges(propositions_from_file)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Success\n"
     ]
    }
   ],
   "source": [
    "if createGraph(list_of_edges):\n",
    "    print(\"Success\")\n",
    "else:\n",
    "    print(\"Failed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "qg = QueryGraph()\n",
    "\n",
    "if refine(qg, \"person\"):\n",
    "    print(\"yes\")\n",
    "else:\n",
    "    print(\"no\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Q and A section"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "# def find_supporting_facts(question, answer, context):\n",
    "#     supporting_facts = []\n",
    "#     for passage in context:\n",
    "#         title, sentences = passage\n",
    "#         for i, sentence in enumerate(sentences):\n",
    "#             if answer in sentence or any(word in sentence for word in question.split()):\n",
    "#                 supporting_facts.append([title, i])\n",
    "#     return supporting_facts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# qg = QueryGraph()\n",
    "# my_dict = {}\n",
    "\n",
    "# # Define a function to apply to each row\n",
    "# def print_qa(row):\n",
    "    \n",
    "#     question = row['question']\n",
    "#     questionid = row['_id']\n",
    "#     print(\"question:\", question)\n",
    "#     result = qg.answer_question(question)\n",
    "\n",
    "#     if result is not None:\n",
    "    \n",
    "#         model_answer = result['result']\n",
    "\n",
    "#         if \"don't know the answer\" in model_answer:\n",
    "#             model_answer = \"\"\n",
    "    \n",
    "#         if len(row['answer']) > 0:\n",
    "#             real_answer = row['answer']\n",
    "#         else:\n",
    "#             real_answer = \"\\\"\\\"\"\n",
    "\n",
    "#         if len(result['intermediate_steps']) > 0:\n",
    "#             cypher_query = result['intermediate_steps'][0]['query']\n",
    "#             context = result['intermediate_steps'][1]['context']\n",
    "       \n",
    "#             if(len(context) < 1):\n",
    "#             #     result = refine_query(cypher_query[6:], question)\n",
    "#             #     model_answer = result['result'] \n",
    "#                 model_answer = \"\\\"\\\"\"\n",
    "#                 my_dict.update({questionid: \"\"})\n",
    "#             else:\n",
    "#                 my_dict.update({questionid: model_answer})\n",
    "                \n",
    "#         with open(\"preds.txt\", \"a\") as preds:\n",
    "#             preds.write(\"question: \" + question + \"\\n\")\n",
    "#             preds.write(\"real_answer: \" + real_answer + \"\\n\")\n",
    "#             preds.write(\"model_answer: \" + model_answer + \"\\n\")  \n",
    "#             preds.write(\"cypher_query: \" + cypher_query + \"\\n\")\n",
    "#             preds.write(\"======================\" + \"\\n\")  \n",
    "#         preds.close()\n",
    "\n",
    "#     else: \n",
    "#         my_dict.update({questionid: \"\"})\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  0%|          | 0/1 [00:00<?, ?it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "question: Were Scott Derrickson and Ed Wood of the same nationality?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p1:Person)-[r1:RELATED]-(e1:Entity), (p2:Person)-[r2:RELATED]-(e2:Entity)\n",
      "WHERE toLower(p1.name) contains 'scott derrickson' AND toLower(p2.name) contains 'ed wood'\n",
      "RETURN r1.description AS description1, r2.description AS description2, r1.metadata AS metadata1, r2.metadata AS metadata2\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Woodson is named after Ed Wood Sr.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Woodson, Woodson Lake, and Wood Hollow are the namesake for Ed Wood Sr.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Wood Hollow is named after Ed Wood Sr.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Woodson, Woodson Lake, and Wood Hollow are the namesake for Ed Wood Sr.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Woodson Lake is named after Ed Wood Sr.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Woodson, Woodson Lake, and Wood Hollow are the namesake for Ed Wood Sr.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Ed Wood Sr owns the Wood Plantation.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"The Wood Plantation is the largest of the plantations owned by Ed Wood Sr.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Ed Wood Sr. is described as a prominent plantation owner, trader, and businessman.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Ed Wood Sr. was a prominent plantation owner, trader, and businessman at the turn of the 20th century.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Ed Wood is associated with the films that he created.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Due to the ongoing interest in the films of Ed Wood, Conrad Brooks reemerged in the 1980s.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Ed Wood experienced a significant period in his life.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"The film concerns the period in Ed Wood\\'s life when Ed Wood made his best-known films.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson wrote the film Doctor Strange.', 'description2': 'Ed Wood is the subject of the 1994 American biographical period comedy-drama film.', 'metadata1': '{\"summary\": \"Scott Derrickson wrote the film Doctor Strange with Jon Spaihts and C. Robert Cargill.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Ed Wood is a 1994 American biographical period comedy-drama film.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson directed the film Doctor Strange.', 'description2': 'Woodson is named after Ed Wood Sr.', 'metadata1': '{\"summary\": \"The film Doctor Strange was directed by Scott Derrickson.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Woodson, Woodson Lake, and Wood Hollow are the namesake for Ed Wood Sr.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}, {'description1': 'Scott Derrickson directed the film Doctor Strange.', 'description2': 'Wood Hollow is named after Ed Wood Sr.', 'metadata1': '{\"summary\": \"The film Doctor Strange was directed by Scott Derrickson.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}', 'metadata2': '{\"summary\": \"Woodson, Woodson Lake, and Wood Hollow are the namesake for Ed Wood Sr.\", \"generated_at\": \"2024-11-11 11:41:00.832541\"}'}]\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 1/1 [00:03<00:00,  3.51s/it]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "# my_dict = {}\n",
    "# # Apply the function to each row\n",
    "# df[0:1].progress_apply(print_qa, axis=1)\n",
    "    \n",
    "# with open(\"dev_fullwiki_pred.json\", \"a\") as json_file:\n",
    "#     json.dump(my_dict, json_file, indent=4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "question = df.iloc[1]['question']\n",
    "\n",
    "qg = QueryGraph()\n",
    "res = qg.test_query(\"Who is Shirley Temple?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "AIMessage(content=\"```cypher\\nMATCH (e:Person)-[]-(entity:Entity)\\nWHERE toLower(e.name) contains 'shirley temple'\\nWITH e\\nMATCH (e)-[rel:RELATED]-(relatedEntity:Entity)\\nRETURN rel.description\\n```\", additional_kwargs={'refusal': None}, response_metadata={'token_usage': {'completion_tokens': 51, 'prompt_tokens': 618, 'total_tokens': 669, 'completion_tokens_details': {'reasoning_tokens': 0, 'audio_tokens': 0, 'accepted_prediction_tokens': 0, 'rejected_prediction_tokens': 0}, 'prompt_tokens_details': {'cached_tokens': 0, 'audio_tokens': 0}}, 'model_name': 'gpt-4o-mini-2024-07-18', 'system_fingerprint': 'fp_0705bf87c0', 'finish_reason': 'stop', 'logprobs': None}, id='run-c6d8d184-24fc-43b6-af33-8e25f8fb890e-0', usage_metadata={'input_tokens': 618, 'output_tokens': 51, 'total_tokens': 669})"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (role:Entity)-[]-(e:Person)-[]-(film:Entity)\n",
      "WHERE toLower(role.name) = \"corliss archer\" AND toLower(film.name) = \"kiss and tell\"\n",
      "WITH e\n",
      "MATCH (e)-[rel:RELATED]-(p:Entity)\n",
      "WHERE toLower(rel.description) CONTAINS 'government position' OR toLower(rel.description) CONTAINS 'position'\n",
      "RETURN rel.description\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'rel.description': 'Shirley Temple Black held the position of a diplomat.'}, {'rel.description': 'Shirley Temple Black held the position of Chief of Protocol of the United States.'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Shirley Temple Black held the position of Chief of Protocol of the United States.'"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res2 = qg.answer_question(\"What government position was held by the woman who portrayed Corliss Archer in the film Kiss and Tell?\")\n",
    "res2['result']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (e1:Person)-[r:RELATED]-(e2:Person)\n",
      "WHERE toLower(e1.name) = 'scott derrickson' AND toLower(e2.name) = 'ed wood'\n",
      "WITH e1, e2, r\n",
      "MATCH (e1)-[rel:RELATED]-(entity:Entity)\n",
      "WHERE toLower(rel.description) CONTAINS 'nationality'\n",
      "RETURN rel.description\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I don't know the answer.\""
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "question = df.iloc[0]['question']\n",
    "res3 = qg.answer_question(question)\n",
    "res3['result']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (movie:Entity)-[r:RELATED]-(actress:Person)                                  \n",
      "WHERE (toLower(r.metadata) CONTAINS 'kiss and tell') OR (toLower(r.description) CONTAINS 'kiss and tell')\n",
      "WITH actress\n",
      "MATCH (actress)-[r2:RELATED]-(position:Entity)\n",
      "WHERE (toLower(r2.metadata) CONTAINS 'government') OR (toLower(r2.description) CONTAINS 'government')\n",
      "RETURN position\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I don't know the answer.\""
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qg = QueryGraph()\n",
    "res2 = qg.answer_question(\"What government position was held by the woman who portrayed Corliss Archer in the film Kiss and Tell?\")\n",
    "res2['result']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Are the Laleli Mosque and Esma Sultan Mansion located in the same neighborhood?\n",
      "no\n"
     ]
    }
   ],
   "source": [
    "question = df.iloc[3]['question']\n",
    "print(question)\n",
    "answer = df.iloc[3]['answer']\n",
    "print(answer)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[['Esma Sultan (daughter of Abdülaziz)', ['Esma Sultan (21 March 1873 – 7 May 1899) was an Ottoman princess, the daughter of Sultan Abdülaziz and his wife Gevheri Kadın, herself the daughter of Salih Bey Svatnba.', ' She was the half-sister of Abdülmecid II, the last Caliph of the Muslim world.']], ['Djamaâ el Kebir', ['The Great Mosque of Algiers (Arabic: الجامع الكبير\\u200e \\u200e , \"Jemaa Kebir\") or “Djama’a al-Kebir” (meaning Great Mosque) is a mosque in Algiers, Algeria, located very close to Algiers Harbor.', ' An inscription on the minbar (منبر) or the pulpit testifies to fact that the mosque was built in 1097.', \" It is also known by several other names such as Grand Mosque d'Alger, Djamaa al-Kebir, El Kebir Mosque and Jami Masjid.\", ' It is one of the few remaining examples of Almoravid architecture.', ' It is the oldest mosque in Algiers and is said to be the oldest mosque in Algeria after Sidi Okba Mosque.', ' It was built under sultan Ali ibn Yusuf.', ' Its minaret dates from 1332 (1324 in some sources) and was built by the Ziyyanid Sultan of Tlemcen.', ' The gallery at the outside of the mosque was built in 1840.', ' Its construction was a consequence of a complete reconstruction of the street by the French.']], ['Küçük Hüseyin Pasha', ['Küçük Hüseyin Pasha (1757 – 7 December 1803), also known as Tayazade Damat Küçük Hüseyin Pasha, was an Ottoman statesman and admiral who was Kapudan Pasha (Grand Admiral of the Ottoman Navy) from 11 March 1792 to 7 December 1803.', ' He was a \"damat\" (\"bridegroom\") to the Ottoman dynasty after he married an Ottoman princess, Esma Sultan.']], ['Esma Sultan (daughter of Abdul Hamid I)', ['Esma Sultan (17 July 1778 – 4 June 1848) was an Ottoman princess, daughter of Sultan Abdul Hamid I, sister of Sultan Mustafa IV and Sultan Mahmud II.', ' She was the adoptive mother of Bezmiâlem Sultan and Rahime Perestu Sultan.']], ['Sultan Ahmed Mosque', ['The Sultan Ahmed Mosque or Sultan Ahmet Mosque (Turkish: \"Sultan Ahmet Camii\" ) is a historic mosque located in Istanbul, Turkey.', \" A popular tourist site, the Sultan Ahmed Mosque continues to function as a mosque today; men still kneel in prayer on the mosque's lush red carpet after the call to prayer.\", ' The Blue Mosque, as it is popularly known, was constructed between 1609 and 1616 during the rule of Ahmed I.', \" Its Külliye contains Ahmed's tomb, a madrasah and a hospice.\", ' Hand-painted blue tiles adorn the mosque’s interior walls, and at night the mosque is bathed in blue as lights frame the mosque’s five main domes, six minarets and eight secondary domes.', ' It sits next to the Hagia Sophia, another popular tourist site.']], ['Laleli Mosque', ['The Laleli Mosque (Turkish: \"Laleli Camii, or Tulip Mosque\" ) is an 18th-century Ottoman imperial mosque located in Laleli, Fatih, Istanbul, Turkey.']], ['Esma Sultan Mansion', ['The Esma Sultan Mansion (Turkish: \"Esma Sultan Yalısı\" ), a historical yalı (English: waterside mansion ) located at Bosphorus in Ortaköy neighborhood of Istanbul, Turkey and named after its original owner Esma Sultan, is used today as a cultural center after being redeveloped.']], ['Esma Sultan', ['Esma Sultan is the name of three daughters of three Ottoman Sultans:']], ['Gevheri Kadın', ['Gevheri Kadın (8 July 1856\\xa0– 6 September 1884) was the fifth wife of 32nd Ottoman Sultan Abdülaziz.', ' She was the mother of Şehzade Mehmed Seyfeddin and Esma Sultan of the Ottoman Empire.']], ['Esma Sultan (daughter of Ahmed III)', ['Esma Sultan (14 March 1726 – 13 August 1788) was an Ottoman princess, daughter of Sultan Ahmed III and his consort Zeynep Kadın.', ' She was the half-sister of Sultan Mustafa III and Abdul Hamid I.']]]\n"
     ]
    }
   ],
   "source": [
    "context = df.iloc[3]['context']\n",
    "print(context)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (series:Entity)-[r:RELATED]-(companion:Entity) \n",
      "WHERE (toLower(r.description) CONTAINS 'science fantasy young adult series') OR (toLower(r.metadata) CONTAINS 'science fantasy young adult series')\n",
      "WITH series, companion\n",
      "MATCH (companion)-[r2:RELATED]-(worlds:Entity) \n",
      "WHERE (toLower(r2.description) CONTAINS 'enslaved worlds') OR (toLower(r2.metadata) CONTAINS 'enslaved worlds')\n",
      "WITH series, companion, worlds\n",
      "MATCH (companion)-[r3:RELATED]-(species:Entity) \n",
      "WHERE (toLower(r3.description) CONTAINS 'alien species') OR (toLower(r3.metadata) CONTAINS 'alien species')\n",
      "RETURN series, companion, worlds, species\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I don't know the answer.\""
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qg = QueryGraph()\n",
    "res2 = qg.answer_question(question)\n",
    "res2['result']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Graph refinement "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "qg = QueryGraph()\n",
    "\n",
    "QUERY = \"\"\"\n",
    "MATCH (N) RETURN N\n",
    "\"\"\"\n",
    "res = qg._graph.query(QUERY)\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_url = \"bolt://localhost:7687\"\n",
    "neo4j_user = \"neo4j\"\n",
    "neo4j_password = \"12345678\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create embeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Now we initialize from existing graph\n",
    "# existing_graph = Neo4jVector.from_existing_graph(\n",
    "#     embedding=OpenAIEmbeddings(model='text-embedding-3-small'),\n",
    "#     url=neo4j_url,\n",
    "#     username=neo4j_user,\n",
    "#     password=neo4j_password,\n",
    "#     index_name=\"person_index\",\n",
    "#     node_label=\"Person\",\n",
    "#     text_node_properties=[\"name\"],\n",
    "#     embedding_node_property=\"embedding\",\n",
    "# )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Refactor node labels"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # cq = \"\"\"\n",
    "# # MATCH (en:Entity)\n",
    "# # WHERE en.label = 'Person'\n",
    "# # WITH collect(en) AS persons\n",
    "# # CALL apoc.refactor.rename.label(\"Entity\", \"Person\", persons)\n",
    "# # YIELD batches, total, timeTaken, committedOperations\n",
    "# # RETURN batches, total, timeTaken, committedOperations;\n",
    "# # \"\"\"\n",
    "# # res = qg._graph.query(cq)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create projection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cq = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN gds.graph.project(\n",
    "  'personproj',\n",
    "  p,\n",
    "  null,\n",
    "  {\n",
    "    sourceNodeProperties: p { .embedding },\n",
    "    targetNodeProperties: {}\n",
    "  }\n",
    ")\n",
    "\"\"\"\n",
    "\n",
    "res = qg._graph.query(cq)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Use KNN to measure node similarities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 236,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Person1': 'Ed Wood',\n",
       "  'Person2': 'Ed Wood Sr',\n",
       "  'similarity': 0.9346900582313538},\n",
       " {'Person1': 'Ed Wood Sr',\n",
       "  'Person2': 'Ed Wood',\n",
       "  'similarity': 0.9346900582313538}]"
      ]
     },
     "execution_count": 236,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cq = \"\"\"\n",
    "CALL gds.knn.stream('projection2', {\n",
    "topK: 1,\n",
    "nodeProperties: ['embedding'],\n",
    "// The following parameters are set to produce a deterministic result\n",
    "randomSeed: 1337,\n",
    "concurrency: 1,\n",
    "sampleRate: 1.0,\n",
    "deltaThreshold: 0.0\n",
    "})\n",
    "YIELD node1, node2, similarity\n",
    "WHERE similarity > .90\n",
    "RETURN gds.util.asNode(node1).name AS Person1, gds.util.asNode(node2).name AS Person2, similarity\n",
    "ORDER BY similarity DESCENDING, Person1, Person2\n",
    "\"\"\"\n",
    "\n",
    "res = qg._graph.query(cq)\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 237,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Person1: Ed Wood\n",
      "Person2: Ed Wood Sr\n",
      "similarity: 0.9346900582313538\n",
      "Person1: Ed Wood Sr\n",
      "Person2: Ed Wood\n",
      "similarity: 0.9346900582313538\n"
     ]
    }
   ],
   "source": [
    "for i in res:\n",
    "    for key, value in i.items():\n",
    "        print(f\"{key}: {value}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 238,
   "metadata": {},
   "outputs": [],
   "source": [
    "def are_dictionaries_equivalent(d1, d2):\n",
    "    # Check if both have the same keys\n",
    "    if d1.keys() != d2.keys():\n",
    "        return False\n",
    "\n",
    "    # Check if Person1 and Person2 are swapped but equivalent\n",
    "    if (d1['Person1'] == d2['Person2'] and d1['Person2'] == d2['Person1'] and d1['similarity'] == d2['similarity']):\n",
    "        return True\n",
    "    \n",
    "    return False\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 239,
   "metadata": {},
   "outputs": [],
   "source": [
    "newlist = res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 240,
   "metadata": {},
   "outputs": [],
   "source": [
    "for idx, val in enumerate(res):   \n",
    "    for idx2, val2 in enumerate(newlist):\n",
    "        if val != val2:\n",
    "            if are_dictionaries_equivalent(val, val2):\n",
    "                newlist.pop(idx2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 241,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Person1': 'Ed Wood',\n",
       "  'Person2': 'Ed Wood Sr',\n",
       "  'similarity': 0.9346900582313538}]"
      ]
     },
     "execution_count": 241,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "unique = []\n",
    "\n",
    "for value in newlist:\n",
    "    if value not in unique:\n",
    "        unique.append(value)\n",
    "\n",
    "unique"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 233,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (n:Person {name: 'Shirley Temple'})\n",
      "RETURN n\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'n': {'name': 'Shirley Temple',\n",
       "   'embedding': [-0.0038625726010650396,\n",
       "    -0.004033572040498257,\n",
       "    -0.052681200206279755,\n",
       "    -0.01091713272035122,\n",
       "    -0.04026195406913757,\n",
       "    0.00812749657779932,\n",
       "    0.022437792271375656,\n",
       "    0.07430087774991989,\n",
       "    -0.05445154756307602,\n",
       "    -0.039457254111766815,\n",
       "    0.020882032811641693,\n",
       "    0.001297582988627255,\n",
       "    0.008328672498464584,\n",
       "    -0.025549309328198433,\n",
       "    -0.031302932649850845,\n",
       "    0.01650981605052948,\n",
       "    0.009629608131945133,\n",
       "    0.05906517431139946,\n",
       "    -0.006585150025784969,\n",
       "    0.039189018309116364,\n",
       "    0.016845108941197395,\n",
       "    0.003584279678761959,\n",
       "    -0.00032439574715681374,\n",
       "    -0.0011844217078760266,\n",
       "    0.01050807535648346,\n",
       "    0.05455883964896202,\n",
       "    -0.04254194721579552,\n",
       "    -0.06695125997066498,\n",
       "    0.024382490664720535,\n",
       "    -0.030900580808520317,\n",
       "    0.028835177421569824,\n",
       "    -0.043400295078754425,\n",
       "    -0.0028013710398226976,\n",
       "    -0.008898669853806496,\n",
       "    -0.004070454277098179,\n",
       "    0.007135030347853899,\n",
       "    -0.007658086717128754,\n",
       "    -0.009260786697268486,\n",
       "    -0.013626297935843468,\n",
       "    0.00684667844325304,\n",
       "    0.005528977606445551,\n",
       "    -0.07279876619577408,\n",
       "    0.04962332919239998,\n",
       "    0.014886998571455479,\n",
       "    0.007738557178527117,\n",
       "    0.00195475690998137,\n",
       "    -0.022437792271375656,\n",
       "    0.01722063682973385,\n",
       "    -0.00786596816033125,\n",
       "    0.008395730517804623,\n",
       "    -0.046833693981170654,\n",
       "    -0.002732636174187064,\n",
       "    -0.021190503612160683,\n",
       "    0.00245434301905334,\n",
       "    -0.03701632097363472,\n",
       "    -0.024489784613251686,\n",
       "    -0.01356594543904066,\n",
       "    0.02481166459619999,\n",
       "    0.039403606206178665,\n",
       "    0.012674067169427872,\n",
       "    0.0006370562477968633,\n",
       "    -0.014283471740782261,\n",
       "    -0.00981737207621336,\n",
       "    0.021552618592977524,\n",
       "    0.0007003427599556744,\n",
       "    0.005210449453443289,\n",
       "    -0.017676634714007378,\n",
       "    0.019902978092432022,\n",
       "    0.015852641314268112,\n",
       "    0.051608264446258545,\n",
       "    0.01261371374130249,\n",
       "    0.001961462665349245,\n",
       "    -0.04742380976676941,\n",
       "    -0.010521487332880497,\n",
       "    -0.006494620814919472,\n",
       "    0.03977913409471512,\n",
       "    -0.03261728212237358,\n",
       "    -0.03213445842266083,\n",
       "    -0.03159799054265022,\n",
       "    -0.038840316236019135,\n",
       "    -0.03505821153521538,\n",
       "    -0.028701061382889748,\n",
       "    0.020627211779356003,\n",
       "    0.051152266561985016,\n",
       "    0.046431344002485275,\n",
       "    -0.029157059267163277,\n",
       "    -0.04267606511712074,\n",
       "    0.0019899625331163406,\n",
       "    -0.003540691686794162,\n",
       "    0.01583923026919365,\n",
       "    -0.018534984439611435,\n",
       "    -0.01665734499692917,\n",
       "    -0.04828215762972832,\n",
       "    0.0047611575573682785,\n",
       "    -0.0079464390873909,\n",
       "    -0.004224688746035099,\n",
       "    0.011815717443823814,\n",
       "    -0.009884431026875973,\n",
       "    -0.005425036884844303,\n",
       "    -0.04168359562754631,\n",
       "    -0.03452174365520477,\n",
       "    -0.013297711499035358,\n",
       "    -0.053083550184965134,\n",
       "    0.029881291091442108,\n",
       "    -0.012010186910629272,\n",
       "    0.02475801855325699,\n",
       "    -0.0033579571172595024,\n",
       "    -0.011292660608887672,\n",
       "    -0.023658256977796555,\n",
       "    0.05337860807776451,\n",
       "    -0.06738043576478958,\n",
       "    -0.04715557396411896,\n",
       "    4.201637420919724e-05,\n",
       "    -0.023242494091391563,\n",
       "    -0.022182969376444817,\n",
       "    0.0011274219723418355,\n",
       "    0.03723090887069702,\n",
       "    0.014270060695707798,\n",
       "    -0.061908457428216934,\n",
       "    -0.005297625903040171,\n",
       "    0.016536640003323555,\n",
       "    -0.013579357415437698,\n",
       "    0.02143191359937191,\n",
       "    -0.03964501619338989,\n",
       "    2.6089968741871417e-05,\n",
       "    0.010729368776082993,\n",
       "    0.027105066925287247,\n",
       "    0.011379837058484554,\n",
       "    -0.03430715575814247,\n",
       "    -0.06641478836536407,\n",
       "    0.04500970244407654,\n",
       "    -0.03937678411602974,\n",
       "    -0.05461248755455017,\n",
       "    -0.019970037043094635,\n",
       "    0.03379750996828079,\n",
       "    -0.02455684170126915,\n",
       "    -0.03269775211811066,\n",
       "    -0.007919615134596825,\n",
       "    -0.016120877116918564,\n",
       "    0.01983592100441456,\n",
       "    0.01789122261106968,\n",
       "    0.003022664226591587,\n",
       "    0.03122246265411377,\n",
       "    -0.04162995144724846,\n",
       "    0.015396644361317158,\n",
       "    -0.005984975956380367,\n",
       "    -0.017113342881202698,\n",
       "    0.014095707796514034,\n",
       "    -0.009233962744474411,\n",
       "    0.03264410421252251,\n",
       "    0.023349788039922714,\n",
       "    0.03272457420825958,\n",
       "    -0.0012573478743433952,\n",
       "    0.01630864106118679,\n",
       "    -0.04830898344516754,\n",
       "    -0.02420813776552677,\n",
       "    -0.008516436442732811,\n",
       "    -0.0343339778482914,\n",
       "    -0.017676634714007378,\n",
       "    -0.02148556150496006,\n",
       "    0.02306814305484295,\n",
       "    -0.03610432520508766,\n",
       "    -0.035460565239191055,\n",
       "    -0.05184967443346977,\n",
       "    0.003916219342499971,\n",
       "    0.025294486433267593,\n",
       "    0.006829913705587387,\n",
       "    0.0259918961673975,\n",
       "    -0.017301106825470924,\n",
       "    -0.020935680717229843,\n",
       "    0.03613114729523659,\n",
       "    0.024087432771921158,\n",
       "    0.04871133342385292,\n",
       "    -0.03065917082130909,\n",
       "    -0.032483164221048355,\n",
       "    -0.011319483630359173,\n",
       "    0.026649069041013718,\n",
       "    0.021203914657235146,\n",
       "    -0.00740997027605772,\n",
       "    0.006796384230256081,\n",
       "    0.0014459501253440976,\n",
       "    0.04077159985899925,\n",
       "    -0.023001084104180336,\n",
       "    -0.052225202322006226,\n",
       "    0.04087889567017555,\n",
       "    0.011627953499555588,\n",
       "    0.03213445842266083,\n",
       "    0.05421013385057449,\n",
       "    0.04946238920092583,\n",
       "    -0.014954057522118092,\n",
       "    0.02404719777405262,\n",
       "    0.053298138082027435,\n",
       "    0.030981052666902542,\n",
       "    -0.00043713796185329556,\n",
       "    0.007751968689262867,\n",
       "    -0.009549138136208057,\n",
       "    0.013324534520506859,\n",
       "    -0.00802020262926817,\n",
       "    -0.01887027733027935,\n",
       "    0.023725315928459167,\n",
       "    -0.01763639971613884,\n",
       "    -0.01605381816625595,\n",
       "    4.261885624146089e-05,\n",
       "    -0.0374186746776104,\n",
       "    -0.04543887451291084,\n",
       "    -0.018910512328147888,\n",
       "    -0.005210449453443289,\n",
       "    0.002140844240784645,\n",
       "    -0.042381007224321365,\n",
       "    -0.006414150819182396,\n",
       "    0.05638283118605614,\n",
       "    -0.036077503114938736,\n",
       "    0.008516436442732811,\n",
       "    -0.023470493033528328,\n",
       "    0.001488699926994741,\n",
       "    0.014270060695707798,\n",
       "    0.009998430497944355,\n",
       "    -0.0403960719704628,\n",
       "    -0.013787238858640194,\n",
       "    0.03599703311920166,\n",
       "    -0.030525052919983864,\n",
       "    0.044124528765678406,\n",
       "    0.06652208417654037,\n",
       "    -0.017099931836128235,\n",
       "    -0.005354625638574362,\n",
       "    -0.03819655254483223,\n",
       "    -0.010937250219285488,\n",
       "    0.017931457608938217,\n",
       "    -0.041764065623283386,\n",
       "    0.006568385288119316,\n",
       "    -0.020466269925236702,\n",
       "    0.034789979457855225,\n",
       "    0.011969951912760735,\n",
       "    -0.005428390111774206,\n",
       "    -0.048174865543842316,\n",
       "    -0.014296883717179298,\n",
       "    -0.008959023281931877,\n",
       "    0.035085033625364304,\n",
       "    -0.007718439679592848,\n",
       "    -0.025039663538336754,\n",
       "    -0.03572879731655121,\n",
       "    0.02795000560581684,\n",
       "    0.008965728804469109,\n",
       "    0.011527365073561668,\n",
       "    0.04428546875715256,\n",
       "    0.01640252210199833,\n",
       "    0.04321253299713135,\n",
       "    -0.04629722610116005,\n",
       "    -0.052010614424943924,\n",
       "    0.03154434263706207,\n",
       "    -0.052949436008930206,\n",
       "    -0.020600387826561928,\n",
       "    -0.04291747510433197,\n",
       "    -0.049811094999313354,\n",
       "    -0.008657258935272694,\n",
       "    -0.03551420941948891,\n",
       "    0.007651381194591522,\n",
       "    -0.0378478467464447,\n",
       "    0.010119135491549969,\n",
       "    0.00961619708687067,\n",
       "    0.007477028761059046,\n",
       "    0.02164650149643421,\n",
       "    -0.009931371547281742,\n",
       "    -0.03087375871837139,\n",
       "    -0.045197464525699615,\n",
       "    0.014766293577849865,\n",
       "    0.010883603245019913,\n",
       "    0.005596036557108164,\n",
       "    0.043507590889930725,\n",
       "    0.030337288975715637,\n",
       "    -0.022840144112706184,\n",
       "    0.04146901145577431,\n",
       "    0.0699554830789566,\n",
       "    0.018011927604675293,\n",
       "    -0.00850973092019558,\n",
       "    -0.0047041573561728,\n",
       "    0.018950747326016426,\n",
       "    0.00925408024340868,\n",
       "    -0.006836619693785906,\n",
       "    0.05767035484313965,\n",
       "    -0.05034756287932396,\n",
       "    -0.012184538878500462,\n",
       "    -0.02292061410844326,\n",
       "    -0.035138681530952454,\n",
       "    0.005864270497113466,\n",
       "    0.019299451261758804,\n",
       "    0.014001825824379921,\n",
       "    -0.008241496048867702,\n",
       "    0.025053076446056366,\n",
       "    0.00036002061096951365,\n",
       "    -0.006461091805249453,\n",
       "    0.011855952441692352,\n",
       "    -0.01681828498840332,\n",
       "    -0.04409770667552948,\n",
       "    0.0052171554416418076,\n",
       "    -0.03419986367225647,\n",
       "    0.028647413477301598,\n",
       "    0.011312778107821941,\n",
       "    -0.015436879359185696,\n",
       "    -0.04321253299713135,\n",
       "    0.08014838397502899,\n",
       "    0.0432661809027195,\n",
       "    0.00879137683659792,\n",
       "    0.0015130086103454232,\n",
       "    -0.007637969218194485,\n",
       "    0.03685538098216057,\n",
       "    -0.002184432465583086,\n",
       "    -0.01569170132279396,\n",
       "    0.012513126246631145,\n",
       "    0.02931799925863743,\n",
       "    -0.006866795942187309,\n",
       "    0.00994478352367878,\n",
       "    0.03623844310641289,\n",
       "    0.0009723490220494568,\n",
       "    -0.004777921829372644,\n",
       "    -0.00828173104673624,\n",
       "    -0.00015800671826582402,\n",
       "    0.048121217638254166,\n",
       "    -0.005917917471379042,\n",
       "    0.0065650325268507,\n",
       "    0.027708593755960464,\n",
       "    -0.043507590889930725,\n",
       "    -0.01604040525853634,\n",
       "    0.0018122574547305703,\n",
       "    -0.0055993893183767796,\n",
       "    0.019567685201764107,\n",
       "    0.02204885333776474,\n",
       "    -0.01748887076973915,\n",
       "    0.01687193289399147,\n",
       "    -0.018937336280941963,\n",
       "    -0.011547482572495937,\n",
       "    -0.07639310508966446,\n",
       "    -0.034280333667993546,\n",
       "    0.030444582924246788,\n",
       "    0.014390765689313412,\n",
       "    -0.054424721747636795,\n",
       "    -0.032992810010910034,\n",
       "    -0.041603125631809235,\n",
       "    -0.016536640003323555,\n",
       "    0.03712361678481102,\n",
       "    0.052681200206279755,\n",
       "    -0.023564375936985016,\n",
       "    0.004915392026305199,\n",
       "    0.011433483101427555,\n",
       "    -0.03430715575814247,\n",
       "    -0.03897443041205406,\n",
       "    0.03626526519656181,\n",
       "    0.002506313379853964,\n",
       "    -0.0025398426223546267,\n",
       "    0.0053579783998429775,\n",
       "    -0.05144732445478439,\n",
       "    -0.02717212587594986,\n",
       "    -0.007832438684999943,\n",
       "    0.04090571776032448,\n",
       "    -0.024074021726846695,\n",
       "    -0.0006274165934883058,\n",
       "    -0.0246104896068573,\n",
       "    -0.03342198207974434,\n",
       "    -0.03387797996401787,\n",
       "    0.0517692044377327,\n",
       "    0.004989156499505043,\n",
       "    0.0018508160719648004,\n",
       "    0.006685737986117601,\n",
       "    -0.01563805527985096,\n",
       "    0.019514039158821106,\n",
       "    0.023510729894042015,\n",
       "    0.0160001702606678,\n",
       "    -0.012043716385960579,\n",
       "    0.0248250775039196,\n",
       "    0.025978483259677887,\n",
       "    0.002727606799453497,\n",
       "    0.034629035741090775,\n",
       "    -0.007751968689262867,\n",
       "    0.020278505980968475,\n",
       "    0.011406660079956055,\n",
       "    0.021244149655103683,\n",
       "    -0.00047402014024555683,\n",
       "    -0.0019111688015982509,\n",
       "    0.005371390376240015,\n",
       "    -0.0017150224884971976,\n",
       "    -0.026179660111665726,\n",
       "    -0.02132461965084076,\n",
       "    -0.01384088583290577,\n",
       "    -0.0008545774617232382,\n",
       "    0.029210705310106277,\n",
       "    -0.0232290830463171,\n",
       "    0.01192301046103239,\n",
       "    0.05142049863934517,\n",
       "    -0.024999428540468216,\n",
       "    0.0022129323333501816,\n",
       "    0.0583677664399147,\n",
       "    -0.03291234001517296,\n",
       "    -0.017032872885465622,\n",
       "    0.025053076446056366,\n",
       "    -0.01284841913729906,\n",
       "    -0.0024828428868204355,\n",
       "    -0.003711690893396735,\n",
       "    0.03892078623175621,\n",
       "    0.02506648749113083,\n",
       "    0.019768862053751945,\n",
       "    0.027239184826612473,\n",
       "    -0.019098276272416115,\n",
       "    -0.030900580808520317,\n",
       "    0.007872674614191055,\n",
       "    -0.009549138136208057,\n",
       "    0.008637141436338425,\n",
       "    0.040020544081926346,\n",
       "    -0.007886085659265518,\n",
       "    0.008731023408472538,\n",
       "    -0.02415449172258377,\n",
       "    -0.02875470742583275,\n",
       "    -0.06813149154186249,\n",
       "    0.03672126308083534,\n",
       "    0.02430202066898346,\n",
       "    0.03339515998959541,\n",
       "    -0.025723662227392197,\n",
       "    -0.007161853369325399,\n",
       "    -0.020600387826561928,\n",
       "    -0.023470493033528328,\n",
       "    -0.004885215777903795,\n",
       "    -0.013800650835037231,\n",
       "    -0.10010500997304916,\n",
       "    0.017716869711875916,\n",
       "    -0.048738155514001846,\n",
       "    -0.015973348170518875,\n",
       "    0.042783357203006744,\n",
       "    0.05131320655345917,\n",
       "    -0.02363143488764763,\n",
       "    -0.0016982578672468662,\n",
       "    -0.019916391000151634,\n",
       "    -0.022129323333501816,\n",
       "    0.012097363360226154,\n",
       "    -0.0043755704537034035,\n",
       "    -0.011004309169948101,\n",
       "    0.05595365911722183,\n",
       "    -0.05691929906606674,\n",
       "    -0.02773541770875454,\n",
       "    0.019500628113746643,\n",
       "    -0.03457539156079292,\n",
       "    0.024060608819127083,\n",
       "    -0.07660768926143646,\n",
       "    0.0002629952796269208,\n",
       "    0.0020922268740832806,\n",
       "    -0.0054015666246414185,\n",
       "    -0.028835177421569824,\n",
       "    -0.044687818735837936,\n",
       "    0.047101929783821106,\n",
       "    -0.01258689071983099,\n",
       "    -0.033770687878131866,\n",
       "    0.008047026582062244,\n",
       "    -0.027869535610079765,\n",
       "    -0.0376332588493824,\n",
       "    -0.02891564927995205,\n",
       "    -0.010031959973275661,\n",
       "    0.039859604090452194,\n",
       "    0.022276852279901505,\n",
       "    -0.00269743031822145,\n",
       "    0.005026038736104965,\n",
       "    0.0013068035477772355,\n",
       "    -0.03886713832616806,\n",
       "    -0.028486473485827446,\n",
       "    -0.0021039622370153666,\n",
       "    -0.033663395792245865,\n",
       "    0.035085033625364304,\n",
       "    0.051152266561985016,\n",
       "    -0.002504636999219656,\n",
       "    0.01130607258528471,\n",
       "    0.009985018521547318,\n",
       "    0.028620591387152672,\n",
       "    -0.03792831674218178,\n",
       "    -0.0637860968708992,\n",
       "    0.006420856341719627,\n",
       "    -0.011017720215022564,\n",
       "    -0.022236617282032967,\n",
       "    -0.02388625778257847,\n",
       "    0.017368165776133537,\n",
       "    -0.006504679564386606,\n",
       "    -0.017193812876939774,\n",
       "    0.017368165776133537,\n",
       "    -0.0463508740067482,\n",
       "    -0.01005207747220993,\n",
       "    0.02215614542365074,\n",
       "    0.02528107538819313,\n",
       "    -0.013203829526901245,\n",
       "    -0.021552618592977524,\n",
       "    0.038733020424842834,\n",
       "    0.04675322398543358,\n",
       "    -0.014363942667841911,\n",
       "    -0.002402372658252716,\n",
       "    0.041147127747535706,\n",
       "    0.025495661422610283,\n",
       "    0.00028101724456064403,\n",
       "    -0.010876897722482681,\n",
       "    -0.0160001702606678,\n",
       "    -0.0013151859166100621,\n",
       "    -0.027292830869555473,\n",
       "    0.04568028822541237,\n",
       "    -0.0215794425457716,\n",
       "    0.02297426015138626,\n",
       "    -0.02727941982448101,\n",
       "    0.03082011081278324,\n",
       "    -0.021968381479382515,\n",
       "    0.009220550768077374,\n",
       "    0.018078986555337906,\n",
       "    0.009461961686611176,\n",
       "    0.009978312999010086,\n",
       "    0.000830687815323472,\n",
       "    -0.018830042332410812,\n",
       "    0.022290263324975967,\n",
       "    0.0023420199286192656,\n",
       "    -0.014779705554246902,\n",
       "    0.014310295693576336,\n",
       "    -0.01661710999906063,\n",
       "    0.023497316986322403,\n",
       "    0.007021030411124229,\n",
       "    0.018172867596149445,\n",
       "    0.005539036355912685,\n",
       "    0.00981737207621336,\n",
       "    -0.00046857164124958217,\n",
       "    0.003932984080165625,\n",
       "    0.008469494991004467,\n",
       "    0.008221378549933434,\n",
       "    -0.017260871827602386,\n",
       "    -0.011299366131424904,\n",
       "    0.022840144112706184,\n",
       "    -0.005337860900908709,\n",
       "    0.006732678972184658,\n",
       "    0.02542860433459282,\n",
       "    0.004623687360435724,\n",
       "    0.018534984439611435,\n",
       "    0.0232290830463171,\n",
       "    -0.0015683319652453065,\n",
       "    -0.022008618339896202,\n",
       "    -0.007342911791056395,\n",
       "    -0.002400696277618408,\n",
       "    0.00814761407673359,\n",
       "    0.00840914249420166,\n",
       "    0.027413537725806236,\n",
       "    0.027467183768749237,\n",
       "    -0.031758930534124374,\n",
       "    0.025214016437530518,\n",
       "    -0.00830184854567051,\n",
       "    0.008174438029527664,\n",
       "    -0.0031081640627235174,\n",
       "    0.030176348984241486,\n",
       "    -0.0230144951492548,\n",
       "    -0.010783015750348568,\n",
       "    0.011534071527421474,\n",
       "    0.009891136549413204,\n",
       "    -0.017354752868413925,\n",
       "    -0.03216128423810005,\n",
       "    -0.04133489355444908,\n",
       "    0.014028649777173996,\n",
       "    -0.04726286977529526,\n",
       "    0.0401814840734005,\n",
       "    -0.07998744398355484,\n",
       "    -0.015195468440651894,\n",
       "    0.013814061880111694,\n",
       "    -0.030793288722634315,\n",
       "    0.013827473856508732,\n",
       "    -0.01178889349102974,\n",
       "    0.02942529320716858,\n",
       "    0.042729709297418594,\n",
       "    -0.027601301670074463,\n",
       "    -0.028271885588765144,\n",
       "    -0.008918787352740765,\n",
       "    0.0026370775885879993,\n",
       "    0.027708593755960464,\n",
       "    0.0062196808867156506,\n",
       "    -0.02528107538819313,\n",
       "    -0.025160370394587517,\n",
       "    -0.015678290277719498,\n",
       "    0.016228169202804565,\n",
       "    -0.012546655721962452,\n",
       "    -0.005911211483180523,\n",
       "    0.0005591007065959275,\n",
       "    0.057348474860191345,\n",
       "    0.04825533553957939,\n",
       "    0.01836063154041767,\n",
       "    -0.04897956922650337,\n",
       "    -0.01834722049534321,\n",
       "    -0.020519917830824852,\n",
       "    -0.02829870954155922,\n",
       "    0.009911254048347473,\n",
       "    -0.012063833884894848,\n",
       "    -0.00631691562011838,\n",
       "    0.007396558299660683,\n",
       "    -0.00991796050220728,\n",
       "    -0.023188848048448563,\n",
       "    -0.021981794387102127,\n",
       "    -0.021418502554297447,\n",
       "    -4.64170916529838e-05,\n",
       "    0.00203187414444983,\n",
       "    -0.009763725101947784,\n",
       "    0.01661710999906063,\n",
       "    0.008315260522067547,\n",
       "    0.03250998631119728,\n",
       "    -0.03452174365520477,\n",
       "    -0.021767206490039825,\n",
       "    -0.025965072214603424,\n",
       "    -0.015986759215593338,\n",
       "    0.012881948612630367,\n",
       "    -0.008006791584193707,\n",
       "    0.05906517431139946,\n",
       "    0.013284299522638321,\n",
       "    0.0024576960131525993,\n",
       "    0.017046283930540085,\n",
       "    0.008261613547801971,\n",
       "    -0.005569213069975376,\n",
       "    0.015866054221987724,\n",
       "    -0.025562720373272896,\n",
       "    0.010997602716088295,\n",
       "    0.0005406595882959664,\n",
       "    -0.01412253174930811,\n",
       "    -0.001959786284714937,\n",
       "    0.02178061753511429,\n",
       "    0.014739470556378365,\n",
       "    -0.019299451261758804,\n",
       "    -0.02773541770875454,\n",
       "    -0.004720922093838453,\n",
       "    -0.04117395356297493,\n",
       "    -0.008395730517804623,\n",
       "    -0.012117480859160423,\n",
       "    -0.020010272040963173,\n",
       "    0.016576875001192093,\n",
       "    0.04541205242276192,\n",
       "    -0.013773826882243156,\n",
       "    -0.0049757445231080055,\n",
       "    -0.029881291091442108,\n",
       "    0.016630521044135094,\n",
       "    -0.057455770671367645,\n",
       "    0.014658999629318714,\n",
       "    0.0077452631667256355,\n",
       "    0.037043146789073944,\n",
       "    0.014189589768648148,\n",
       "    -0.008985846303403378,\n",
       "    0.03387797996401787,\n",
       "    0.0064577385783195496,\n",
       "    0.005542389582842588,\n",
       "    0.0005909535102546215,\n",
       "    -0.0015063027385622263,\n",
       "    0.0376332588493824,\n",
       "    -0.035809267312288284,\n",
       "    -0.0024644017685204744,\n",
       "    0.007798909675329924,\n",
       "    0.002932135248556733,\n",
       "    -0.0014132590731605887,\n",
       "    0.020895445719361305,\n",
       "    -0.0029673411045223475,\n",
       "    -0.004526452627032995,\n",
       "    -0.03538009151816368,\n",
       "    -0.0013394945999607444,\n",
       "    -0.006196210626512766,\n",
       "    -0.012841712683439255,\n",
       "    0.009200433269143105,\n",
       "    0.006907030940055847,\n",
       "    -0.04712875187397003,\n",
       "    0.022424381226301193,\n",
       "    -0.013472063466906548,\n",
       "    0.03994007408618927,\n",
       "    0.010695839300751686,\n",
       "    0.055148955434560776,\n",
       "    -0.007852557115256786,\n",
       "    -0.03301963210105896,\n",
       "    0.0033210748806595802,\n",
       "    -0.008114084601402283,\n",
       "    0.025455426424741745,\n",
       "    -0.017730282619595528,\n",
       "    -0.01979568600654602,\n",
       "    -0.03014952503144741,\n",
       "    0.03819655254483223,\n",
       "    0.021163679659366608,\n",
       "    0.013217240571975708,\n",
       "    -0.027239184826612473,\n",
       "    0.018749572336673737,\n",
       "    0.0017787280958145857,\n",
       "    -0.026944126933813095,\n",
       "    -0.04112030565738678,\n",
       "    -0.01999686099588871,\n",
       "    -0.009676549583673477,\n",
       "    -0.014417588710784912,\n",
       "    0.002933811629191041,\n",
       "    -0.03275139629840851,\n",
       "    0.012379009276628494,\n",
       "    0.021512383595108986,\n",
       "    -0.019983449950814247,\n",
       "    -0.0047812750563025475,\n",
       "    0.0027494006790220737,\n",
       "    -0.015342997387051582,\n",
       "    -0.03162481263279915,\n",
       "    -0.03594338521361351,\n",
       "    0.023457081988453865,\n",
       "    0.019661568105220795,\n",
       "    -0.005941387731581926,\n",
       "    0.00533115491271019,\n",
       "    0.01968839205801487,\n",
       "    0.004566687624901533,\n",
       "    -0.008308554999530315,\n",
       "    0.011138426139950752,\n",
       "    -0.06625384837388992,\n",
       "    -0.03334151208400726,\n",
       "    0.001782081089913845,\n",
       "    -0.009582667611539364,\n",
       "    0.00030700245406478643,\n",
       "    0.002400696277618408,\n",
       "    0.03779420256614685,\n",
       "    -0.02097591571509838,\n",
       "    0.04747745767235756,\n",
       "    0.010494663380086422,\n",
       "    -0.0344412736594677,\n",
       "    -0.0321076363325119,\n",
       "    -0.004787980578839779,\n",
       "    0.013907943852245808,\n",
       "    0.034763153642416,\n",
       "    -0.0093814916908741,\n",
       "    -0.015061351470649242,\n",
       "    -0.02230367437005043,\n",
       "    -0.006028564181178808,\n",
       "    0.021042974665760994,\n",
       "    0.030122702941298485,\n",
       "    0.006672326009720564,\n",
       "    0.003993337042629719,\n",
       "    -0.03908172622323036,\n",
       "    0.001481994055211544,\n",
       "    0.009757019579410553,\n",
       "    0.03634573519229889,\n",
       "    0.0029304588679224253,\n",
       "    -0.03943042829632759,\n",
       "    0.0038223376031965017,\n",
       "    0.03419986367225647,\n",
       "    0.006960677914321423,\n",
       "    0.015208880417048931,\n",
       "    0.015503937378525734,\n",
       "    0.02593824826180935,\n",
       "    0.017649810761213303,\n",
       "    0.03661397099494934,\n",
       "    -0.05158143863081932,\n",
       "    0.0020737857557833195,\n",
       "    0.030122702941298485,\n",
       "    -0.013633004389703274,\n",
       "    0.03264410421252251,\n",
       "    -0.005160155706107616,\n",
       "    0.008798082359135151,\n",
       "    0.052895788103342056,\n",
       "    0.04168359562754631,\n",
       "    0.01865568943321705,\n",
       "    0.016992637887597084,\n",
       "    -0.014551706612110138,\n",
       "    -0.031410228461027145,\n",
       "    0.016684168949723244,\n",
       "    0.007751968689262867,\n",
       "    0.009998430497944355,\n",
       "    -0.017515694722533226,\n",
       "    -0.011996774934232235,\n",
       "    0.0060989754274487495,\n",
       "    -0.00997160654515028,\n",
       "    0.014042060822248459,\n",
       "    0.005297625903040171,\n",
       "    0.005180273205041885,\n",
       "    0.05179602652788162,\n",
       "    0.007906203158199787,\n",
       "    -0.010541604831814766,\n",
       "    0.008496318943798542,\n",
       "    -0.00497239176183939,\n",
       "    -0.01937992125749588,\n",
       "    0.02255849726498127,\n",
       "    0.015879465267062187,\n",
       "    -0.03465586155653,\n",
       "    -0.04568028822541237,\n",
       "    0.02021144889295101,\n",
       "    -0.002082168124616146,\n",
       "    -0.028701061382889748,\n",
       "    -0.015423467382788658,\n",
       "    -0.0009824078297242522,\n",
       "    0.004452688153833151,\n",
       "    0.014109119772911072,\n",
       "    -0.03358292207121849,\n",
       "    0.027654947713017464,\n",
       "    -0.0005041965050622821,\n",
       "    0.025348134338855743,\n",
       "    -0.016174523159861565,\n",
       "    0.010005136020481586,\n",
       "    -0.010762898251414299,\n",
       "    0.00553568359464407,\n",
       "    -0.0059011527337133884,\n",
       "    -0.01484676357358694,\n",
       "    -0.028942471370100975,\n",
       "    -0.011312778107821941,\n",
       "    -0.024382490664720535,\n",
       "    -0.008308554999530315,\n",
       "    -0.014457824639976025,\n",
       "    0.0038022201042622328,\n",
       "    -0.0009916283888742328,\n",
       "    -0.040986187756061554,\n",
       "    0.0009195404127240181,\n",
       "    -0.0010100695071741939,\n",
       "    0.009039493277668953,\n",
       "    -0.07038465887308121,\n",
       "    -0.015544172376394272,\n",
       "    0.00894561130553484,\n",
       "    -0.013800650835037231,\n",
       "    0.012171127833425999,\n",
       "    0.01769004575908184,\n",
       "    0.01650981605052948,\n",
       "    -0.022115910425782204,\n",
       "    0.039403606206178665,\n",
       "    0.011775482445955276,\n",
       "    -0.002362137660384178,\n",
       "    0.03843796253204346,\n",
       "    0.058582354336977005,\n",
       "    -0.030954228714108467,\n",
       "    0.05058897286653519,\n",
       "    -0.022571910172700882,\n",
       "    0.01743522472679615,\n",
       "    0.00021773074695374817,\n",
       "    0.0065214443020522594,\n",
       "    0.025509074330329895,\n",
       "    -0.0016454493161290884,\n",
       "    0.024087432771921158,\n",
       "    -0.00526744918897748,\n",
       "    0.011245719157159328,\n",
       "    -0.0049019805155694485,\n",
       "    0.028942471370100975,\n",
       "    -0.008576788939535618,\n",
       "    0.032429516315460205,\n",
       "    -0.006152622401714325,\n",
       "    -0.041147127747535706,\n",
       "    0.012680772691965103,\n",
       "    -0.03261728212237358,\n",
       "    -0.027145301923155785,\n",
       "    0.026219895109534264,\n",
       "    0.0022481379564851522,\n",
       "    -0.018856866285204887,\n",
       "    -0.010977485217154026,\n",
       "    -0.011339601129293442,\n",
       "    -0.014672411605715752,\n",
       "    0.00769161619246006,\n",
       "    0.03183940052986145,\n",
       "    -0.017649810761213303,\n",
       "    -0.007255735341459513,\n",
       "    0.037821024656295776,\n",
       "    -0.005022685509175062,\n",
       "    -0.009280904196202755,\n",
       "    -0.04302476719021797,\n",
       "    0.046109460294246674,\n",
       "    -0.0005452698678709567,\n",
       "    0.016375698149204254,\n",
       "    -0.010474545881152153,\n",
       "    -0.01133289560675621,\n",
       "    0.014632176607847214,\n",
       "    0.04128124564886093,\n",
       "    -0.04734333977103233,\n",
       "    0.014243236742913723,\n",
       "    0.02506648749113083,\n",
       "    -0.01133289560675621,\n",
       "    0.0052808611653745174,\n",
       "    -0.008630435913801193,\n",
       "    0.01512840948998928,\n",
       "    0.04490240663290024,\n",
       "    -0.013700062409043312,\n",
       "    -0.011218896135687828,\n",
       "    -0.008590200915932655,\n",
       "    -0.00043294677743688226,\n",
       "    0.004419158678501844,\n",
       "    -0.015664877369999886,\n",
       "    0.02086862176656723,\n",
       "    0.03087375871837139,\n",
       "    -0.025924837216734886,\n",
       "    0.037552788853645325,\n",
       "    0.04962332919239998,\n",
       "    -0.006692443508654833,\n",
       "    -0.008831611834466457,\n",
       "    0.006927148438990116,\n",
       "    0.017113342881202698,\n",
       "    0.050937678664922714,\n",
       "    0.004647157620638609,\n",
       "    0.004432570654898882,\n",
       "    -0.016804873943328857,\n",
       "    0.012881948612630367,\n",
       "    -0.006692443508654833,\n",
       "    0.0070009129121899605,\n",
       "    -0.0053613316267728806,\n",
       "    0.030122702941298485,\n",
       "    -0.03446809574961662,\n",
       "    -0.02795000560581684,\n",
       "    0.013029476627707481,\n",
       "    0.01481994055211544,\n",
       "    0.02579071931540966,\n",
       "    -0.012291832827031612,\n",
       "    -0.01722063682973385,\n",
       "    0.02486531250178814,\n",
       "    0.0006735193310305476,\n",
       "    0.025039663538336754,\n",
       "    -0.04136171564459801,\n",
       "    0.01135971862822771,\n",
       "    -0.017099931836128235,\n",
       "    0.002357108285650611,\n",
       "    0.0054015666246414185,\n",
       "    0.02188791148364544,\n",
       "    -0.017475459724664688,\n",
       "    -0.014954057522118092,\n",
       "    0.003969866316765547,\n",
       "    -0.029237529262900352,\n",
       "    0.0049757445231080055,\n",
       "    0.0546393096446991,\n",
       "    -0.008938904851675034,\n",
       "    0.040127839893102646,\n",
       "    -0.003450162708759308,\n",
       "    -0.08106037974357605,\n",
       "    -0.029103413224220276,\n",
       "    -0.026742951944470406,\n",
       "    -0.02824506349861622,\n",
       "    0.005830741487443447,\n",
       "    0.003829043358564377,\n",
       "    0.017609575763344765,\n",
       "    0.02829870954155922,\n",
       "    -0.008140908554196358,\n",
       "    -0.00936137419193983,\n",
       "    0.03511185944080353,\n",
       "    0.024583665654063225,\n",
       "    0.03261728212237358,\n",
       "    -0.03256363421678543,\n",
       "    -0.009730196557939053,\n",
       "    -0.005046156235039234,\n",
       "    -0.01484676357358694,\n",
       "    -0.01952745020389557,\n",
       "    -0.017596164718270302,\n",
       "    0.006591856013983488,\n",
       "    0.016013583168387413,\n",
       "    -0.001110657351091504,\n",
       "    0.011312778107821941,\n",
       "    -0.03132975473999977,\n",
       "    -0.052010614424943924,\n",
       "    0.03387797996401787,\n",
       "    0.006041975691914558,\n",
       "    -0.003959807567298412,\n",
       "    -0.035245977342128754,\n",
       "    0.0349777415394783,\n",
       "    0.009113257750868797,\n",
       "    -0.025240840390324593,\n",
       "    -0.003456868464127183,\n",
       "    -0.03127611055970192,\n",
       "    -0.04707510396838188,\n",
       "    0.015651466324925423,\n",
       "    -0.017770517617464066,\n",
       "    0.03132975473999977,\n",
       "    -0.04219324141740799,\n",
       "    0.02477142959833145,\n",
       "    0.005223861429840326,\n",
       "    -0.015503937378525734,\n",
       "    -0.013337946496903896,\n",
       "    -0.01923239417374134,\n",
       "    0.012607008218765259,\n",
       "    -0.024020373821258545,\n",
       "    0.014176178723573685,\n",
       "    -0.01978227309882641,\n",
       "    0.010467840358614922,\n",
       "    0.040127839893102646,\n",
       "    -0.013230652548372746,\n",
       "    -0.0007430926198139787,\n",
       "    -0.006377268582582474,\n",
       "    -0.013002653606235981,\n",
       "    0.007456911262124777,\n",
       "    -0.029559411108493805,\n",
       "    0.00755079323425889,\n",
       "    -0.028835177421569824,\n",
       "    0.02851329743862152,\n",
       "    -0.02383260987699032,\n",
       "    0.03637256100773811,\n",
       "    0.04841627553105354,\n",
       "    -0.01723404787480831,\n",
       "    0.0006852545775473118,\n",
       "    -0.0032372516579926014,\n",
       "    -0.037767376750707626,\n",
       "    0.021042974665760994,\n",
       "    0.007034442387521267,\n",
       "    0.01563805527985096,\n",
       "    -0.02998858503997326,\n",
       "    -0.005756977014243603,\n",
       "    0.007188676856458187,\n",
       "    -0.013331240974366665,\n",
       "    0.06169386953115463,\n",
       "    0.0115072475746274,\n",
       "    0.008221378549933434,\n",
       "    0.009549138136208057,\n",
       "    -0.026836832985281944,\n",
       "    -0.028030475601553917,\n",
       "    -0.05356637388467789,\n",
       "    0.0028399296570569277,\n",
       "    0.015021116472780704,\n",
       "    -0.020291918888688087,\n",
       "    -0.024342255666851997,\n",
       "    -0.022236617282032967,\n",
       "    0.003099781693890691,\n",
       "    -0.02686365693807602,\n",
       "    0.019031217321753502,\n",
       "    0.0011651423992589116,\n",
       "    0.07676862925291061,\n",
       "    -0.004885215777903795,\n",
       "    0.05107179656624794,\n",
       "    ...],\n",
       "   'label': 'Person'}}]"
      ]
     },
     "execution_count": 233,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "node_name = \"Shirley Temple\"\n",
    "\n",
    "query = f\"\"\"\n",
    "MATCH (n:Person {{name: '{node_name}'}})\n",
    "RETURN n\n",
    "\"\"\"\n",
    "print(query)\n",
    "\n",
    "res = qg._graph.query(query)\n",
    "res\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Merge similar nodes (Entity resolution)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 242,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'Person1': 'Ed Wood', 'Person2': 'Ed Wood Sr', 'similarity': 0.9346900582313538}\n"
     ]
    }
   ],
   "source": [
    "for idx, val in enumerate(unique):\n",
    "    print(val)\n",
    "    p1 = val['Person1']\n",
    "    p2 = val['Person2']    \n",
    "    cq = f\"\"\"\n",
    "    MATCH (a1:Person {{name: '{p1}'}}), (a2:Person {{name: '{p2}'}})\n",
    "    WITH head(collect([a1,a2])) as nodes\n",
    "    CALL apoc.refactor.mergeNodes(nodes,{{\n",
    "    properties:\"discard\",\n",
    "    mergeRels:true\n",
    "    }})\n",
    "    YIELD node\n",
    "    RETURN node;\n",
    "    \"\"\"\n",
    "    res = qg._graph.query(cq)\n",
    "    res"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graphmaker",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
